<template>
  <div class="home-container">
    <div class="img-container">
      <img src="https://picsum.photos/1455/218">
    </div>
    <h2 style="margin-top: 24px">
      您好，欢迎进入AI知识库系统～
    </h2>

    <div style="margin-top: 20px; color: rgb(146, 146, 146); font-size: 16px;">
      中国教育科学研究院 AI 知识库系统是一款聚焦教育科研领域的智能知识管理与应用平台，整合三大核心知识库模块，融合 AI 技术赋能高效知识交互。
    </div>
    <div class="home-card" >
      <h2 style="display: flex; align-items: center; gap: 10px;">
        <svg width="34px" height="34px" viewBox="0 0 34 34" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
          <g id="图形" stroke="none" fill="none" fill-rule="evenodd" stroke-width="1">
            <g id="编组" transform="translate(6.3252, 2.0418)">
              <path d="M21.3496094,10.7212891 C21.3496094,4.82773437 16.5716797,0 10.6748047,0 C4.77792969,0 0,4.82773437 0,10.7212891 C0,13.0554687 1.23847656,16.0669922 3.22734375,18.2882812 C5.19960938,20.4896484 6.66386719,24.1951172 6.66386719,27.1501953 L6.66386719,28.3089844 L14.6857422,28.3089844 L14.6857422,27.1601562 C14.6857422,24.2050781 16.15,20.50625 18.1123047,18.2982422 C20.1078125,16.0537109 21.3496094,12.7732422 21.3496094,10.7212891 Z" id="路径" fill="#FFC807" fill-rule="nonzero"></path>
              <path d="M14.8085938,25.9980469 L8.37050781,17.0996094 L13.4771484,6.4546875 L20.0912109,15.3 C19.5134766,16.5085937 18.7863281,17.5378906 17.9695313,18.4609375 C16.4289063,20.3667969 15.725,22.0302734 15.0576172,24.3511719 L14.8085938,25.9980469 Z" id="路径" fill="#FFB300" fill-rule="nonzero"></path>
              <path d="M10.2597656,12.3083984 L7.51386719,12.3083984 C7.09550781,12.3083984 6.80332031,11.8867187 6.95605469,11.4949219 L8.92167969,6.41484375 C9.01132813,6.18574219 9.23378906,6.03300781 9.47949219,6.03300781 L12.9658203,6.03300781 C13.4173828,6.03300781 13.70625,6.51445312 13.49375,6.91289062 L10.7876953,11.9929687 C10.6814453,12.1855469 10.4789063,12.3083984 10.2597656,12.3083984 Z" id="路径" fill="#FFF8E1" fill-rule="nonzero"></path>
              <path d="M9.15410156,16.9568359 L14.4666016,11.2791016 C14.8650391,10.8541016 14.5628906,10.1601562 13.9818359,10.1601562 L10.4955078,10.1601562 C10.2066406,10.1601562 9.95097656,10.3460938 9.86132812,10.6216797 L8.03515625,16.2994141 C7.81601562,16.9767578 8.66933594,17.478125 9.15410156,16.9568359 Z" id="路径" fill="#FFF8E1" fill-rule="nonzero"></path>
              <path d="M13.3841797,31.7058388 L7.96542969,31.7058388 C7.77617188,31.7058388 7.60351563,31.5829873 7.50058594,31.3804482 L6.76347656,29.9128701 L14.5861328,29.9128701 L13.8490234,31.3804482 C13.7460938,31.5829873 13.5734375,31.7058388 13.3841797,31.7058388 L13.3841797,31.7058388 Z" id="路径" fill="#455A64" fill-rule="nonzero"></path>
              <path d="M14.45,30.5105263 L6.89960938,30.5105263 C6.16582031,30.5105263 5.56816406,29.9161904 5.56816406,29.179081 L5.56816406,23.7470498 C5.56816406,23.0132607 6.1625,22.4156044 6.89960938,22.4156044 L14.4533203,22.4156044 C15.1871094,22.4156044 15.7847656,23.0099404 15.7847656,23.7470498 L15.7847656,29.1824013 C15.7814453,29.9161904 15.1871094,30.5105263 14.45,30.5105263 L14.45,30.5105263 Z" id="路径" fill="#ECEFF1" fill-rule="nonzero"></path>
              <path d="M11.5978516,24.8062294 L5.59472656,24.8062294 L5.59472656,23.6109169 L11.5978516,23.6109169 C11.9265625,23.6109169 12.1955078,23.8798623 12.1955078,24.2085732 C12.1955078,24.5406044 11.9265625,24.8062294 11.5978516,24.8062294 Z M5.59472656,25.8521279 L15.7548828,25.8521279 L15.7548828,27.0474404 L5.59472656,27.0474404 L5.59472656,25.8521279 Z M15.7548828,29.2886513 L10.1037109,29.2886513 C9.775,29.2886513 9.50605469,29.019706 9.50605469,28.6909951 C9.50605469,28.3622841 9.775,28.0933388 10.1037109,28.0933388 L15.7548828,28.0933388 L15.7548828,29.2886513 Z" id="形状" fill="#CFD8DC" fill-rule="nonzero"></path>
            </g>
          </g>
        </svg>
        核心知识库模块
      </h2>
      <ul>
        <li>
          机构知识库：汇聚中国教育科学研究院各类科研成果、政策文件、研究报告等核心资源，实现机构知识资产的系统化沉淀与管理。
        </li>
        <li>
          共享知识库：搭建开放共享的知识交流空间，支持跨部门、跨领域的知识流通，促进科研经验与成果的共建共用。
        </li>
        <li>
          我的知识库：提供个性化知识存储功能，用户可自定义收藏、整理专属知识内容，打造私人化知识管理中心。
        </li>
      </ul>
    </div>
    <div class="home-card" >
      <h2 style="display: flex; align-items: center; gap: 10px;">
        <svg width="24px" height="26px" viewBox="0 0 24 26" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
          <defs>
            <path d="M22.7307692,5.62977508 L13.2115385,0.320242768 C12.4423077,-0.106747589 11.5192308,-0.106747589 10.75,0.320242768 L1.23076923,5.62977508 C0.461538447,6.05676544 0,6.83648698 0,7.69046769 L0,18.3095323 C0,19.163513 0.461538473,19.9432346 1.23076923,20.3702249 L10.7692308,25.6797572 C11.5384615,26.1067476 12.4615385,26.1067476 13.2307692,25.6797572 L22.7692308,20.3702249 C23.5384616,19.9432346 24,19.163513 24,18.3095323 L24,7.69046769 C23.9615385,6.83648698 23.5,6.05676544 22.7307692,5.62977508 Z M19.1538462,10.2709746 L12.6153846,13.8354159 L12.6153846,21.0199929 C12.5961539,21.3912888 12.5192308,21.6697608 12.1923077,21.74402 C12.0384615,21.836844 11.8846154,21.8739736 11.7115385,21.8739736 L11.6346154,21.8739736 C11.3898002,21.8739736 11.1550119,21.780089 10.9819014,21.6129734 C10.8087909,21.4458578 10.7115385,21.2192004 10.7115385,20.9828633 L10.7115385,13.6312031 C10.7115385,13.5755088 10.7115385,13.5198143 10.7307692,13.46412 L4.88461539,10.2709746 C4.4423077,10.0296323 4.19230769,9.49125313 4.44230768,9.06426277 C4.69230768,8.63727242 5.21153846,8.48875402 5.63461539,8.7300964 L12,12.2945377 L18.3846154,8.7300964 C18.8269231,8.48875402 19.3076923,8.63727242 19.5576923,9.06426277 C19.8076923,9.47268834 19.5961538,10.0296323 19.1538462,10.2709746 Z" id="path-1"></path>
          </defs>
          <g id="页面-1" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <g id="首页" transform="translate(-461, -730)">
              <g id="矩形-4" transform="translate(461, 730)">
                <mask id="mask-2" fill="white">
                  <use xlink:href="#path-1"></use>
                </mask>
                <use id="蒙版" fill="#1979FF" fill-rule="nonzero" xlink:href="#path-1"></use>
                <path d="M12.6153846,13.9321671 L19.1287861,8.67474201 L24,13.4665164 C24.7046997,16.24827 24.5402909,18.3672394 23.5067735,19.8234248 C22.4732562,21.2796101 20.1387631,22.6496442 16.5032944,23.933527 L12.6153846,21.1669858 L12.6153846,13.9321671 Z" fill="#186ADC" mask="url(#mask-2)"></path>
              </g>
            </g>
          </g>
        </svg>
        核心知识库模块
      </h2>
      <ul>
        <li>
          机构知识库：汇聚中国教育科学研究院各类科研成果、政策文件、研究报告等核心资源，实现机构知识资产的系统化沉淀与管理。
        </li>
        <li>
          共享知识库：搭建开放共享的知识交流空间，支持跨部门、跨领域的知识流通，促进科研经验与成果的共建共用。
        </li>
        <li>
          我的知识库：提供个性化知识存储功能，用户可自定义收藏、整理专属知识内容，打造私人化知识管理中心。
        </li>
      </ul>
    </div>

    <div class="btn">
      <el-button type="primary">
        新手指南<el-icon class="el-icon--right"><ArrowRight /></el-icon>
      </el-button>
    </div>
  </div>
</template>

<script setup lang="ts">
import { useRouter } from 'vue-router'
import { ArrowRight } from '@element-plus/icons-vue'

const router = useRouter()

const goToHome = () => {
  router.push('/user-home')
}
</script>

<style lang="scss" scoped>
.home-container {
  width: 100%;
  overflow: hidden;

  .img-container {
    img {
      width: 100%;
      border-radius: 12px;
    }
  }

  .home-card {
    margin-top: 16px;
    padding: 10px 18px;
    border-radius:11px;
    background:rgba(223, 234, 251, .4);
  }

  ul {
    margin-left: 54px;
    li {
      list-style: disc;  /* 实心圆点 */
      color: rgba(146, 146, 146, 1);
      font-family: SourceHanSansCN-Regular;
      font-weight: 400;
      font-size: 16px;
      line-height: 32px;
    }
  }

  .btn {
    display: flex;
    justify-content: center;
    margin-top: 16px;
  }
}
</style>